**`CIC1A-6`**

In [1]:
import pandas as pd
import matplotlib.pyplot as plt

## **Age Distribution Analysis**

**`CIC1A-7`**

In [7]:
age_df = pd.read_csv(r"C:\Users\Adnan\Desktop\Codes\Cyber Square DS\covid-19-india-analysis-by-me\data\raw\agedistribution_2016_estimates.csv")
age_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21 entries, 0 to 20
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     21 non-null     object
 1   M       21 non-null     float64
 2   F       21 non-null     float64
 3   Tot     21 non-null     float64
dtypes: float64(3), object(1)
memory usage: 804.0+ bytes

In [8]:
age_df.sample(5)

      Age     M    F   Tot
0     0-4   8.7  8.2   8.5
14  70-74   1.4  1.5   1.5
3   15-19  10.4  9.9  10.1
8   40-44   6.1  6.1   6.1
12  60-64   3.0  3.1   3.1

**`CIC1A-8`**

In [9]:
age_df.describe(include="all")

        Age          M          F        Tot
count    21  21.000000  21.000000  21.000000
unique   21        NaN        NaN        NaN
top     0-4        NaN        NaN        NaN
freq      1        NaN        NaN        NaN
mean    NaN   9.523810   9.523810   9.542857
std     NaN  14.529243  14.571236  14.527752
min     NaN   0.200000   0.300000   0.300000
25%     NaN   3.000000   3.100000   3.100000
50%     NaN   6.100000   6.100000   6.100000
75%     NaN   9.500000   9.400000   9.600000
max     NaN  67.500000  68.200000  67.800000

In [ ]:
# null values
age_df.isna().sum()

Age    0
M      0
F      0
Tot    0
dtype: int64

In [10]:
age_df.dtypes

Age     object
M      float64
F      float64
Tot    float64
dtype: object